---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyStillPresetIndex
source: html/f118cd9f-12d2-c1b2-d1ca-9fdc279bace4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyStillPresetIndex Property

"Still presets combo"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyStillPresetIndex { get; }
```